USE ProjectFirmDavidowsky
GO
SELECT *FROM Position

SELECT *FROM Employee
------------------
INSERT INTO Employee
VALUES
(1,'Давыдовский Дмитрий Сергеевич', 28, 'Лобанка 199',3733398, 864464467556, 111),
(2,'Михайловский Василий Игнатьевич', 28, 'Плеханова 78',3110949, 86411111156, 222),
(3,'Пименов Андрей Иванович', 50, 'Независимости 55',1111111, 123423465556, 333),
(4,'Поздняк Андрей Владимирович', 38, 'Нёманская 19',3735555, 8655553224, 444),
(5,'Брайчук Наталья Александровна', 48, 'Кунцевщина 44',8787887, 864464467556, 555),
(6,'Лапян Екатерина Валерьевна', 20, 'Маяковского 88',4444448, 863333333556, 666),
(7,'Давыдовский Сергей Николаевич', 58, 'Лобанка 109',6119089, 87664543436, 777),
(8,'Давыдовская Анна Олеговна', 27, 'Лобанка 199',5987606, 556576878556, 888),
(9,'Иванов Иван Иванович', 35, 'Рокосовского 89',4234565, 811456700956, 999),
(10,'Пашкевич Марина Олеговна', 25, 'Шаранговича 33',9997365, 2123421236, 123);

SELECT *FROM Employee

------------
INSERT INTO TypeOfWork
VALUES
(8786,'Проектирование объекта',56,9754),
(1116,'Строительномонтажные работы',75,29754),
(5586,'Отделочные работы',30,15777),
(3333,'Пусконаладочные работы',99,754),
(7675,'Ввод объекта в эксплуатацию',85,4656),
(7771,'Реконструкция объекта',125,21000);

SELECT *FROM TypeOfWork

--------
INSERT INTO Customer
VALUES
(18, 'Аврутин ОА','Минск', NULL, 6565878, 789000)

INSERT Customer
(Customer_ID,FullName,Adress,Telephone,PassportData,AmountMoneyForProject)
VALUES
(19, 'Миклашевич ИВ','Барановичи', NULL, 6908787, 55000),
(20, 'Римашевский ФВ','Минск', 8676786, 6565878, 33000),
(21, 'Герасимёнок ОГ','Минск', NULL, 7868660, 564000);

SELECT *FROM Customer
SELECT *FROM TypeOfWork

SELECT *FROM Project



INSERT INTO Project
VALUES
(101,CAST(N'2020-03-21' AS Date),CAST(N'2021-09-21' AS Date),'в стадии выполнения','не оплачен', 1116, 20),
(102,CAST(N'2018-09-02' AS Date),CAST(N'2021-04-21' AS Date),'объект завершен','оплачен полностью', 7771, 18),
(103,CAST(N'2019-05-03' AS Date),CAST(N'2021-04-21' AS Date),'объект завершен','оплачен полностью', 5586, 19),
(104,CAST(N'2020-03-21' AS Date),CAST(N'2021-04-21' AS Date),'объект завершен','оплачен полностью', 1116, 20),
(105,CAST(N'2018-11-21' AS Date),CAST(N'2021-04-21' AS Date),'объект завершен','оплачен полностью', 5586, 18),
(106,CAST(N'2021-05-11' AS Date),CAST(N'2022-01-18' AS Date),'в стадии выполнения','не оплачен', 7675, 21),
(107,CAST(N'2021-07-13' AS Date),CAST(N'2022-03-19' AS Date),'в стадии выполнения','не оплачен', 3333, 21),
(108,CAST(N'2020-03-21' AS Date),CAST(N'2022-07-20' AS Date),'в стадии выполнения','не оплачен', 3333, 20),
(109,CAST(N'2020-03-21' AS Date),CAST(N'2021-04-21' AS Date),'объект завершен','оплачен полностью', 8786, 20);

SELECT *FROM Project
SELECT *FROM Employee



INSERT INTO Design
VALUES
(1,101,'коттедж','согласовано', 20),
(5,101,'коттедж','согласовано', 20),
(6,101,'коттедж','согласовано', 20),
(2,107,'церковь','согласовано', 21),
(3,107,'церковь','согласовано', 21),
(4,107,'церковь','согласовано', 21),
(1,106,'гостиница','не согласовано', 21),
(3,106,'гостиница','не согласовано', 21),
(6,106,'гостиница','не согласовано', 21),
(9,106,'гостиница','не согласовано', 21);

SELECT *FROM Design